Repository: Chrisaiki/blog-posts
Catalog: posts/2015-08-14-contribute.*.po
Languages: fr_fr

source: # Contribute
fr_fr: # Contribuer

source: > This page is an improved copy of the FAQ section [Getting involved](/faq#gettinginvolved).
fr_fr: > Cette page est une copie améliorée de la section de la FAQ [s'impliquer](/faq#simpliquer).

source: ### How may I help?
fr_fr: ### Comment puis-je aider ?

source: You can help on project developement in many ways, depending your available time, energy and skills. Please read below requirements and possibilities. If you feel comfortable with one these profiles, do not hesitate to [contact us](/contact).
fr_fr: Vous pouvez aider le projet de différentes manières, en fonction de votre temps disponible, énergie et compétences. Veuillez lire les prérequis et possibilités ci-dessous. Si vous vous sentez à l'aise avec l'un de ces profils, n'hésitez pas à [nous contacter](/contact).

source: #### As a backend developer
fr_fr: #### Comme développeur back-end

source: You may participate to duniter server's development, which is the core software implementing [UCP](https://github.com/duniter/duniter/blob/master/doc/Protocol.md). You will need some technical skills:
fr_fr: Vous pouvez participer au développement de la partie serveur de duniter qui est le cœur du logiciel implémentant le protocole [UCP](https://github.com/duniter/duniter/blob/master/doc/Protocol.md). Vous aurez besoin de quelques compétences techniques :

source: * Node.js development involving: * JavaScript (ES5 code only, but ES6 ready with [Promises/A+](https://promisesaplus.com/)) * lot of asynchronous JavaScript * massive usage of [async.js](https://github.com/caolan/async) and [Q](https://github.com/kriskowal/q) (we tend to replace async.js by Q) * unit tests using [Mocha](https://mochajs.org/) * Crypto: * understanding the basics of asymmetric cryptography * optionnaly know the [Ed25519](http://ed25519.cr.yp.to/) scheme
fr_fr: * Développement Node.js impliquant : * JavaScript (uniquement du code ES5, mais prêt pour ES6 grâce aux [Promises/A+](https://promisesaplus.com/)) * beaucoup de code JavaScript asynchrone * usage intensif des librairies [async.js](https://github.com/caolan/async) et [Q](https://github.com/kriskowal/q) (nous tendons à remplacer async.js par Q) * tests unitaires avec [Mocha](https://mochajs.org/) * Cryptographie : * comprendre les bases de la cryptographie asymétrique * optionnellement, connaître le schéma [Ed25519](http://ed25519.cr.yp.to/)

source: If you are not affraid by those technologies, you can both start reading the Wiki to [Dive into duniter code](https://github.com/duniter/duniter/wiki/Dive-into-the-code) and [contact us](/contact).
fr_fr: Si vous n'êtes pas effrayé par ces technologies, vous pouvez commencer à lire le Wiki pour vous [plonger dans le code de duniter (en)](https://github.com/duniter/duniter/wiki/Dive-into-the-code) et [nous contacter](/contact).

source: #### As a designer/frontend developer
fr_fr: #### Comme designer/développeur front-end

source: See this beautiful website? You want to improve it with new content, new design? Feel free to propose your skills, any help is welcome. What probably duniter needs the most is: **a logo**!
fr_fr: Voyez-vous ce magnifique site web ? Vous voulez en améliorer le contenu, le design ? Sentez-vous libre de proposer vos compétences, toute aide est la bienvenue. Ce que Duniter a probablement le plus besoin est **un logo** !

source: #### As a mathematician
fr_fr: #### Comme mathématicien

source: duniter protocol will use Graph Theory properties to build a Web of Trust of unique & living individuals. Even if duniter team is made up of engineers/PhDs, Graph Theory is not something easy and we probably need experts in that domain. So, if Graph Theory is your every day life, **do not hesitate to come to us!**
fr_fr: Le protocole Duniter utilise les propriétés de la Théorie des Graphes pour construire une Toile de Confiance d'individus vivants et uniques. Même si l'équipe duniter est composée d'ingénieurs et docteurs, la Théorie des Graphes n'est pas quelque chose de facile et nous aurions probablement besoin d'experts dans ce domaine. Donc, si la Théorie des Graphes est votre vie de tous les jours, **n'hésitez pas à venir nous voir !**

source: #### As a preacher
fr_fr: #### Comme apôtre

source: Well, here, you do not need us to do the job: speak about duniter, make articles, share links, knowledge, experiences, whatever! No need to ask, simply do it!
fr_fr: Hé bien, ici, vous n'avez pas besoin de nous pour vous aider : parlez de Duniter, faites-en des articles, partagez des liens, des connaissances, peu importe ! Pas besoin de nous demander, faites, tout simplement !
