Repository: Chrisaiki/blog-posts
Catalog: posts/navigation.*.po
Languages: fr_fr

source: Link ==============
fr_fr: Lien ==============

source: <li class="drawer-list-item"> <a href="#" title="Follow me on twitter!"> <i class="fa fa-twitter"></i> Follow me </a> </li>
fr_fr: <li class="drawer-list-item"> <a href="#" title="Suivez-nous sur twitter!"> <i class="fa fa-twitter"></i> Nous suivre </a> </li>

source: Divider ==============
fr_fr: Diviseur ==============

source: Title ==============
fr_fr: Titre ==============

source: <li class="drawer-list-item drawer-list-title"> Follow me </li>
fr_fr: <li class="drawer-list-item drawer-list-title"> Nous suivre </li>

source: ProTip: ==============
fr_fr: Astuce de pro: ==============

source: <li class="drawer-list-item"> <a href="/" data-pjax> <i class="fa fa-home"></i>Home </a> </li>
fr_fr: <li class="drawer-list-item"> <a href="/" data-pjax> <i class="fa fa-home"></i>Accueil </a> </li>

source: <li class="drawer-list-item"> <a href="/presentation" data-pjax> <i class="fa fa-book"></i>Presentation </a> </li>
fr_fr: <li class="drawer-list-item"> <a href="/presentation" data-pjax> <i class="fa fa-book"></i>Présentation </a> </li>

source: <li class="drawer-list-item"> <a href="/theoretical" data-pjax> <i class="fa fa-graduation-cap"></i>Theoretical </a> </li>
fr_fr: <li class="drawer-list-item"> <a href="/theoretical" data-pjax> <i class="fa fa-graduation-cap"></i>Théorie </a> </li>

source: <li class="drawer-list-item drawer-list-title"> Join us </li>
fr_fr: <li class="drawer-list-item drawer-list-title"> Nous rejoindre </li>

source: <li class="drawer-list-item"> <a href="/contribute" data-pjax> <i class="fa fa-users"></i>Contribute </a> </li>
fr_fr: <li class="drawer-list-item"> <a href="/contribute" data-pjax> <i class="fa fa-users"></i>Contribuer </a> </li>

source: <li class="drawer-list-item drawer-list-title"> Follow us </li>
fr_fr: <li class="drawer-list-item drawer-list-title"> Nous suivre </li>

source: <li class="drawer-list-item drawer-list-title"> News </li>
fr_fr: <li class="drawer-list-item drawer-list-title"> Nouveautés </li>

source: <li class="drawer-list-item"> <a href="{{@blog.url}}/rss/"> <i class="fa fa-rss"></i>Subscribe to Feed </a> </li>
fr_fr: <li class="drawer-list-item"> <a href="{{@blog.url}}/rss/"> <i class="fa fa-rss"></i>Souscrire au flux </a> </li>
